
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/railgun-0402/aws-ecs-terraform/actions/runs/9940666299)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01b4181d47b75a48a]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0f20c51a85fe8855e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0976e976e55165e74]
aws_security_group.alb: Refreshing state... [id=sg-0a34280c839615c8e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0605d5b5292d129a2]
aws_security_group.ecs: Refreshing state... [id=sg-0266ad44b28d18856]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f5b5cb453fe9e076]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-098e87735554434dd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e334d45359b4e750]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0df3711fc20783636]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00b603f53cdd89bc8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06321e43e8fc70f2e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-095aa2eb3ad7a1a86]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e121dc93b6238a2e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ea05b1221237569e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-058e7196cd55256ae]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-4093621102]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00c51391578727e12]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f5b5cb453fe9e0761080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09e77d5073d2cd0d0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-015fdd72014e47093]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e9f6746244244a]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-07ef48a8535c03f6f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0cdcef87f3a9725f2]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-00b603f53cdd89bc81080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0df3711fc207836361080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-simple-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0a34280c839615c8e",
        ]
      + subnets                                                      = [
          + "subnet-06321e43e8fc70f2e",
          + "subnet-0e121dc93b6238a2e",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01b4181d47b75a48a"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_health_state (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:997623562234:targetgroup/go-simple-server-target-group/2fbf36f98b3ab598]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Creation complete after 2m46s [id=arn:aws:elasticloadbalancing:ap-northeast-1:997623562234:loadbalancer/app/go-simple-server-alb/2e364a7d0844e34a]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:997623562234:listener/app/go-simple-server-alb/2e364a7d0844e34a/29279d5a3b5e5115]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:997623562234:listener-rule/app/go-simple-server-alb/2e364a7d0844e34a/29279d5a3b5e5115/b58f24fe2fd4442d]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"8125ea982b151ab5741be539eadb732ca5fc9a07","Vars":{},"WorkflowName":"Terraform"} -->